load-test.yml
config:
  target: "http://localhost:3333"  # 여기에 실제 서버 URL을 입력하세요
  phases:
    - duration: 30
      arrivalRate: 5
      name: Sustained load
  processor: "./test-functions.js"
  plugins:
    cloud:
      auth:
        api_key: # 여기에 Artillery Cloud API 키를 입력하세요

scenarios:
  - name: "Email Verification Test"
    flow:
      - function: "generateRandomEmail"
      - post:
          url: "/api/v1/auth/email-verification"
          json:
            email: "{{ email }}"
          capture:
            - json: "$.data.code"
              as: "verificationCode"
            - json: "$.data.timestamp"
              as: "sendTime"
      - log: "Email sent to {{ email }} with code {{ verificationCode }} at {{ sendTime }}"
      - think: 2
      # 여기에 이메일 인증 확인 단계를 추가할 수 있습니다 (필요한 경우)